{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/Const_63", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/Const_61", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/Const_5", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_absolute_/BroadcastTo_4", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/Const_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/BroadcastTo/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_38/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_35/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_32/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_29/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_26/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_23/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_20/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_17/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_14/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_11/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_8/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_6/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_15/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_11", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_16/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_6", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_10", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_7", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_6/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_5", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_6/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_3/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/clip_by_value", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/Slice/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/Reshape/shape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_4/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_7/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat_2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/ExpandDims", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_3", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_8/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_2/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_9", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_9", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_17/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/concat_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_3/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_5/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_3/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_4/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_9/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_5/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_12/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_6/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_33", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_15/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_7/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_36", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_18/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_8/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_39", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_21/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_9/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_42", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_24/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_10/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_45", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_27/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_15", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_11/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_48", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_30/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_12/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_51", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_33/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_13/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_54", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_36/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/pjit__lambda__/BroadcastTo_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_absolute_/BroadcastTo_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_14/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/Slice", "op": "Slice", "input": ["xs_0", "StatefulPartitionedCall/jax2tf_main_/clip_by_value", "StatefulPartitionedCall/jax2tf_main_/Slice/size"], "attr": {"T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/Slice", "StatefulPartitionedCall/jax2tf_main_/Reshape/shape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sin", "op": "Sin", "input": ["StatefulPartitionedCall/jax2tf_main_/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Cos", "op": "Cos", "input": ["StatefulPartitionedCall/jax2tf_main_/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sin"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_3", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sin", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_3/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Cos", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_4", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Cos", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_4/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Neg", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat_1", "op": "ConcatV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_4", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_5", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat_1/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "N": {"i": "3"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_7", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_7/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_6", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_6/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat_2", "op": "ConcatV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_6", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape_7", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/BroadcastTo_8", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat_2/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/concat_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/ExpandDims"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "transpose_a": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_38", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_38/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_35", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_35/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_32", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_32/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_29", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_29/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_26", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_26/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_23", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_23/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_20", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_20/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_17", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_17/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_14", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_14/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_11", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_11/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_8", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_8/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_matmul_/Squeeze"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_1", "op": "Square", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_1", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_1/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_1", "op": "Rsqrt", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_8", "op": "StridedSlice", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_8", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_8", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_8"], "attr": {"Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_6", "op": "StridedSlice", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_6", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_6", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_6"], "attr": {"T": {"type": "DT_FLOAT"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_7", "op": "StridedSlice", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_7", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_7", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_7"], "attr": {"shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_5", "op": "StridedSlice", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_5", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_5", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_5"], "attr": {"end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_3", "op": "StridedSlice", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_3"], "attr": {"T": {"type": "DT_FLOAT"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_6", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_5", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_6/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Sub_8", "op": "Neg", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_7", "op": "Const", "input": ["^StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_3", "^StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_5"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_8", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Sub_8", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_8/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_6", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_7", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Reshape_8", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_2", "op": "Square", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_2", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_2/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_2", "op": "Rsqrt", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_2", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/concat", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_11", "op": "StridedSlice", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_11", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_11", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_11"], "attr": {"shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "Index": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_10", "op": "StridedSlice", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_10", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_10", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_10"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_9", "op": "StridedSlice", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/clip_by_value_9", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/add_9", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/ones_like_9"], "attr": {"ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Mul_6", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_7", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Mul_9", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_6", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Mul_7", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_8", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Mul_10", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_6", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Mul_8", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_8", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Mul_11", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_7", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/StridedSlice_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_cross_/Sub_15", "op": "Sub", "input": 