{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "512"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_outer_/BroadcastTo", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_outer_/BroadcastTo_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "512"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "2"}]}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_outer_/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/pjit_outer_/BroadcastTo", "StatefulPartitionedCall/jax2tf_main_/pjit_outer_/BroadcastTo_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/pjit_outer_/Mul", "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/pjit_outer_/Mul", "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/pjit_outer_/Mul", "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape", "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1", "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2", "StatefulPartitionedCall/jax2tf_main_/concat/axis"], "attr": {"N": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_main_/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_outer_/BroadcastTo", "shape": [512, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_outer_/BroadcastTo_1", "shape": [1, 512], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/concat/axis", "shape": [], "dtype": "int32"}]}]}