{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/Const_21", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/Const_19", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_8", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/clip_by_value", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Slice/size", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape/shape_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_6/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_2/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Cast", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_3/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Slice", "op": "Slice", "input": ["xs_0", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/clip_by_value", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Slice", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape/shape_1"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_6", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_6/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_1", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_6", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_2", "op": "Square", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_2", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_2/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_2", "op": "Sqrt", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_2", "op": "RealDiv", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_3", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Cast"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_8", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_1", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_3", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_3/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_3", "op": "Sqrt", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_2", "op": "Sub", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_3", "StatefulPartitionedCall/Const_17"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_clip_/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/Const_19", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_clip_/Minimum", "op": "Minimum", "input": ["StatefulPartitionedCall/Const_21", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_clip_/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_clip_/Minimum", "StatefulPartitionedCall/jax2tf_main_/vmap/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/transpose", "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/transpose", "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/transpose", "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape", "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1", "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2", "StatefulPartitionedCall/jax2tf_main_/concat/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "3"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/jax2tf_main_/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Const_21", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/Const_19", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_8", "shape": [1, 1, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv", "shape": [3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/clip_by_value", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Slice/size", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape/shape_1", "shape": [0], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_1", "shape": [92, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_6/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_5", "shape": [92, 1, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_2/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Cast", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_1", "shape": [1, 1, 3], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_3/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/Const_17", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/transpose/perm", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2/shape", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/jax2tf_main_/concat/axis", "shape": [], "dtype": "int32"}]}]}