{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "3"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/Const_97", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/Const_95", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/Const_11", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_absolute_/BroadcastTo_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/Const_5", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/Const_9", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/Const_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/Sum_1/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/BroadcastTo_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Reshape_20/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Cast", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_dot_/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/Const_5", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_absolute_/BroadcastTo_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/Const_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/Const_3", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/Const_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/Sum/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_norm_/BroadcastTo/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_38", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_35", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_32", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_26", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_23", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_11", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_5/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/clip_by_value", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Slice/size", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape/shape_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_6/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_3/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_12/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_6/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_26", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_15/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_7/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_29", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_18/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_9", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_8/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_32", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_21/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_11", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_9/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_35", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_24/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_13", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_10/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_38", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_27/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_11/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_41", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_30/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_17", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_12/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_44", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_33/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_13/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_47", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_36/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/pjit__lambda__/BroadcastTo_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_absolute_/BroadcastTo_2", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_14/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_15/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_59", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_39/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_24", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_16/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_64", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_40/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_17/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_67", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_41/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_28", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_18/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_70", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_42/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_30", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_19/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_73", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_43/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_32", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_20/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/Const_76", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_44/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_34", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_21/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_79", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_45/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_36", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_22/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_82", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_46/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_38", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_23/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_85", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_47/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_40", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_24/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/Const_88", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_48/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/jvp/pjit__lambda__/BroadcastTo_3", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/transpose/jax2tf_main_/vmap/vmap/jvp/pjit_absolute_/BroadcastTo_7", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_25/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/pjit_atleast_3d_/Reshape_2/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Slice", "op": "Slice", "input": ["xs_0", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/clip_by_value", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Slice/size"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Slice", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape/shape_1"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_6", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_6/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_1", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_6", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_3", "op": "Square", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_3", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/ArithmeticOptimizer/ReplaceMulWithSquare_Mul_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_3/reduction_indices"], "attr": {"keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_3", "op": "Sqrt", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_3", "op": "RealDiv", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_9", "op": "Const", "input": ["^StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_3"], "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_4", "op": "Const", "input": ["^StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_3"], "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "92"}, {"size": "92"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_4", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_4", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_11", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_1", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_3", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_1", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_3"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_5", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_5/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_5", "op": "Sqrt", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_5", "op": "Add", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_5", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_4"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_12", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_5", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_12/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_5", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_6", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_14", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_2", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_5", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_2", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_5"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_6", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_5", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_6/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_6", "op": "Sqrt", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_6", "op": "Sub", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_6", "StatefulPartitionedCall/Const_26"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_7", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_5", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_15", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_7", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_15/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_6", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_15"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_8", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_17", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_6"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_3", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_7", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_7", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_7", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_7/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_7", "op": "Sqrt", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_8", "op": "Sub", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_7", "StatefulPartitionedCall/Const_29"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_9", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_7", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_18", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_9", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_18/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_7", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_18"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_10", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_20", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_7"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_4", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_9", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_4", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_8", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_9", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_8/reduction_indices"], "attr": {"keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_8", "op": "Sqrt", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_10", "op": "Sub", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_8", "StatefulPartitionedCall/Const_32"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_11", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_9", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_21", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_11", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_21/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_8", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_21"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_12", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_23", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_8"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_5", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_11", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_5", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_11"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_9", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_11", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_9/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_9", "op": "Sqrt", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_12", "op": "Sub", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_9", "StatefulPartitionedCall/Const_35"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_13", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_11", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_12"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_24", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_13", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_24/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_9", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_24"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_14", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_26", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_9"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_6", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_13", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_6", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/BroadcastTo_13"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_10", "op": "Sum", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_13", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_10/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}, "Tidx": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_10", "op": "Sqrt", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sum_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_14", "op": "Sub", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_norm_/Sqrt_10", "StatefulPartitionedCall/Const_38"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_15", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_13", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_27", "op": "Reshape", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_15", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_27/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_10", "op": "Mul", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_true_divide_/truediv_3", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Reshape_27"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_16", "op": "AddV2", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/BroadcastTo_29", "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/Mul_10"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_absolute_/Abs_7", "op": "Abs", "input": ["StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit_fn_/AddV2_16"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/jax2tf_main_/vmap/vmap/pjit__lambda__/Sub_15", "op": "SquaredDifference", "input": 