{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}, {"size": "160"}]}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/jax2tf_main_fail_/pjit_outer_/BroadcastTo", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "160"}, {"size": "1"}]}}}}}, {"name": "PartitionedCall/jax2tf_main_fail_/pjit_outer_/BroadcastTo_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "160"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_fail_/pjit_outer_/Mul", "op": "Mul", "input": ["PartitionedCall/jax2tf_main_fail_/pjit_outer_/BroadcastTo", "PartitionedCall/jax2tf_main_fail_/pjit_outer_/BroadcastTo_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/jax2tf_main_fail_/pjit_outer_/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/jax2tf_main_fail_/pjit_outer_/BroadcastTo", "shape": [160, 1], "dtype": "float32"}, {"name": "PartitionedCall/jax2tf_main_fail_/pjit_outer_/BroadcastTo_1", "shape": [1, 160], "dtype": "float32"}]}]}