{"format": "graph-model", "generatedBy": "2.11.0", "convertedBy": "TensorFlow.js Converter v4.2.0", "signature": {"inputs": {"xs_0": {"name": "xs_0:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {}}}}, "modelTopology": {"node": [{"name": "PartitionedCall/jax2tf_main_/pjit_norm_/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "xs_0", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/pjit_norm_/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "op": "Square", "input": ["xs_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/jax2tf_main_/pjit_norm_/Sum", "op": "Sum", "input": ["PartitionedCall/jax2tf_main_/pjit_norm_/ArithmeticOptimizer/ReplaceMulWithSquare_Mul", "PartitionedCall/jax2tf_main_/pjit_norm_/Sum/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "PartitionedCall/jax2tf_main_/pjit_norm_/Sqrt", "op": "Sqrt", "input": ["PartitionedCall/jax2tf_main_/pjit_norm_/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["PartitionedCall/jax2tf_main_/pjit_norm_/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1286}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "PartitionedCall/jax2tf_main_/pjit_norm_/Sum/reduction_indices", "shape": [2], "dtype": "int32"}]}]}